In [4]:
%%sql
select name, type from airport where iso_country = 'FI'

                         name           type
0         Aavahelukka Airport  small_airport
1             Ahmosuo Airport  small_airport
2             Alavus Airfield  small_airport
3    Jorvin Hospital Heliport       heliport
4        Kilpisj?rvi Heliport       heliport
..                        ...            ...
112   M?ntt? - Sassi Airfield  small_airport
113               Taivalkoski  small_airport
114          Parkano Airfield  small_airport
115            Soini Airfield  small_airport
116      Hangasj?rvi Airstrip         closed

[117 rows x 2 columns]

In [6]:
%%sql
select name from airport where iso_country = 'FI' order by name ASC;

                                         name
0                             ?ht?ri Airfield
1                         Aavahelukka Airport
2                             Ahmosuo Airport
3                             Alavus Airfield
4    Central Finland Central Hospital Helipor
..                                        ...
112                           Varkaus Airport
113                       Viitasaari Airfield
114                           Vuotso Airfield
115                          Wredeby Airfield
116                        Ylivieska Airfield

[117 rows x 1 columns]

In [8]:
%%sql
select name, type from airport where iso_country = 'FI' order by type, name;

                           name           type
0            Haapaj?rvi Airport         closed
1            Haapam?ki Airfield         closed
2          Hangasj?rvi Airstrip         closed
3        Helsinki Malmi Airport         closed
4    Sonkaj?rvi-Jyrkk? Airfield         closed
..                          ...            ...
112              Vaala Airfield  small_airport
113            Vampula Airfield  small_airport
114         Viitasaari Airfield  small_airport
115             Vuotso Airfield  small_airport
116            Wredeby Airfield  small_airport

[117 rows x 2 columns]

In [14]:
%%sql
select name from country where name LIKE 'F%';

                          name
0                      Finland
1                         Fiji
2             Falkland Islands
3                Faroe Islands
4                       France
5                French Guiana
6             French Polynesia
7  French Southern Territories

In [16]:
%%sql
select name from country where name LIKE '%f%';

                           name
0                   Afghanistan
1                  Burkina Faso
2      Central African Republic
3                       Finland
4                          Fiji
5              Falkland Islands
6                 Faroe Islands
7                        France
8                 French Guiana
9                   Isle of Man
10               Norfolk Island
11             French Polynesia
12  French Southern Territories
13            Wallis and Futuna
14                 South Africa

In [17]:
%%sql
select location from game where screen_name = 'Vesa';

  location
0     EGCC

In [19]:
%%sql
select co2_consumed from game where screen_name = 'Ilkka';

   co2_consumed
0          8000

In [22]:
%%sql
select co2_budget from game limit 1;

   co2_budget
0       10000

In [25]:
%%sql
select screen_name,co2_budget,co2_consumed, co2_budget-co2_consumed AS co2left from game where screen_name = 'Ilkka';

  screen_name  co2_budget  co2_consumed  co2left
0       Ilkka       10000          8000     2000